In [1]:
%load_ext jupyter_ai_magics

In [2]:
from datascience import *

## Coming back to Tables 

Now that you have learned about arrays, its going to be easy to learn how to create tables - each column of a table is an array! Suggested Reading: https://inferentialthinking.com/chapters/06/Tables.html

Let's look at how to create an empty Table. An empty table is useful because it can be extended to contain new rows and columns.

In [4]:
# create an empty Table
Table()

##### with_columns
The `with_columns` method on a table constructs a new table with additional labeled columns.

In [7]:
# add one column
Table().with_columns('Number of petals', make_array(8, 34, 5))

Number of petals
8
34
5

In [8]:
# add two or more columns
Table().with_columns(
    'Number of petals', make_array(8, 34, 5),
    'Name', make_array('lotus', 'sunflower', 'rose')
)

Number of petals | Name
8                | lotus
34               | sunflower
5                | rose

We can give it a name and further extend it!

In [9]:
flowers = Table().with_columns(
    'Number of petals', make_array(8, 34, 5),
    'Name', make_array('lotus', 'sunflower', 'rose')
)

flowers.with_columns(
    'Color', make_array('pink', 'yellow', 'red')
)

Number of petals | Name      | Color
8                | lotus     | pink
34               | sunflower | yellow
5                | rose      | red

#### read_table
You may have an existing table that you may want to read! We will use the Table method `read_table` to read a CSV (comma-separated values) file below. Open up this file on your devices and see what it looks like! You should get very familiar with looking at data in this course!

In [13]:
movies = Table.read_table("data/movies_by_year_with_ticket_price.csv")
movies

Year | Average Ticket Price | Total Gross | Number of Movies | #1 Movie
2019 | 9.16                 | 11237.9     | 788              | Avengers: Endgame
2018 | 9.11                 | 11611.3     | 878              | Black Panther
2017 | 8.97                 | 11125.4     | 740              | Star Wars: Episode VIII - The Last Jedi
2016 | 8.65                 | 11373.7     | 737              | Rogue One: A Star Wars Story
2015 | 8.43                 | 11098.8     | 706              | Star Wars: Episode VII - The Force Awakens
2014 | 8.17                 | 10436.8     | 708              | American Sniper
2013 | 8.13                 | 10955.9     | 689              | The Hunger Games: Catching Fire
2012 | 7.96                 | 10959.6     | 669              | The Avengers
2011 | 7.93                 | 10114.1     | 601              | Harry Potter and the Deathly Hallows: Part 2
2010 | 7.89                 | 10212.7     | 538              | Toy Story 3
... (33 rows omitted)

#### num_columns/num_rows
The method `num_columns` gives the number of columns in the table, and `num_rows` the number of rows.

In [14]:
movies.num_columns

5

#### Accessing data in a column
We can use a columnâ€™s label to access the array of data in the column as shown below.

In [18]:
movies.column("#1 Movie")

array(['Avengers: Endgame', 'Black Panther',
       'Star Wars: Episode VIII - The Last Jedi',
       'Rogue One: A Star Wars Story',
       'Star Wars: Episode VII - The Force Awakens', 'American Sniper',
       'The Hunger Games: Catching Fire', 'The Avengers',
       'Harry Potter and the Deathly Hallows: Part 2', 'Toy Story 3',
       'Avatar', 'The Dark Knight', 'Spider-Man 3',
       "Pirates of the Caribbean: Dead Man's Chest",
       'Star Wars: Episode III - Revenge of the Sith', 'Shrek 2',
       'The Lord of the Rings: The Return of the King', 'Spider-Man',
       "Harry Potter and the Sorcerer's Stone",
       'How the Grinch Stole Christmas',
       'Star Wars: Episode I - The Phantom Menace', 'Saving Private Ryan',
       'Titanic', 'Independence Day', 'Toy Story', 'Forrest Gump',
       'Jurassic Park', 'Aladdin', 'Terminator 2: Judgment Day',
       'Home Alone', 'Batman', 'Rain Man', 'Three Men and a Baby',
       'Top Gun', 'Back to the Future', 'Beverly Hills Cop',
       'Star Wars: Episode VI - Return of the Jedi',
       'E.T. the Extra-Terrestrial', 'Raiders of the Lost Ark',
       'Star Wars: Episode V - The Empire Strikes Back',
       'Kramer vs. Kramer', 'Grease', 'Star Wars: Episode IV - A New Hope'],
      dtype='<U46')

Recall `show`, `select`, `drop`, `sort`, `where` and other methods - you can use all of those on the movies table!

In [19]:
movies.show(2)

In [20]:
movies.select('Year')

Year
2019
2018
2017
2016
2015
2014
2013
2012
2011
2010
... (33 rows omitted)

In [21]:
movies.drop('Number of Movies')

Year | Average Ticket Price | Total Gross | #1 Movie
2019 | 9.16                 | 11237.9     | Avengers: Endgame
2018 | 9.11                 | 11611.3     | Black Panther
2017 | 8.97                 | 11125.4     | Star Wars: Episode VIII - The Last Jedi
2016 | 8.65                 | 11373.7     | Rogue One: A Star Wars Story
2015 | 8.43                 | 11098.8     | Star Wars: Episode VII - The Force Awakens
2014 | 8.17                 | 10436.8     | American Sniper
2013 | 8.13                 | 10955.9     | The Hunger Games: Catching Fire
2012 | 7.96                 | 10959.6     | The Avengers
2011 | 7.93                 | 10114.1     | Harry Potter and the Deathly Hallows: Part 2
2010 | 7.89                 | 10212.7     | Toy Story 3
... (33 rows omitted)

In [23]:
movies.sort('Year')

Year | Average Ticket Price | Total Gross | Number of Movies | #1 Movie
1977 | 2.23                 | 1373.1      | 35               | Star Wars: Episode IV - A New Hope
1978 | 2.34                 | 1552.3      | 55               | Grease
1979 | 2.47                 | 1957.5      | 83               | Kramer vs. Kramer
1980 | 2.69                 | 2299        | 115              | Star Wars: Episode V - The Empire Strikes Back
1981 | 2.78                 | 2281.9      | 112              | Raiders of the Lost Ark
1982 | 2.94                 | 2866.2      | 131              | E.T. the Extra-Terrestrial
1983 | 3.15                 | 2652.9      | 158              | Star Wars: Episode VI - Return of the Jedi
1984 | 3.36                 | 3347.7      | 165              | Beverly Hills Cop
1985 | 3.55                 | 3056.4      | 180              | Back to the Future
1986 | 3.71                 | 3200.5      | 207              | Top Gun
... (33 rows omitted)

In [25]:
movies.where('Year', 2019)

Year | Average Ticket Price | Total Gross | Number of Movies | #1 Movie
2019 | 9.16                 | 11237.9     | 788              | Avengers: Endgame

##### chatgpt time! 
Let's work on an interesting problem on the movies table with chatgpt! Say we want to add a Tickets Sold column to our table. Think about how you would calculate the tickets sold in a year?

In [26]:
%%ai openai-chat:gpt-3.5-turbo
I have a table called movies which has columns Year, Average Ticket Price, Total Gross, Number of Movies and #1 Movie. In addition to the columns given, I want to add a column called Tickets Sold. Can you help me calculate that based on the given information? Please use the datascience module in Python.

Sure, I'd be happy to help you calculate the Tickets Sold column in the movies table using the datascience module in Python.

To calculate the Tickets Sold, we can use the formula:

Tickets Sold = Total Gross / Average Ticket Price

Here's how you can do it in Python using the datascience module:

``` python
from datascience import Table

# Load the movies table
movies = Table.read_table('movies.csv')

# Calculate the Tickets Sold column
tickets_sold = movies.column('Total Gross') / movies.column('Average Ticket Price')

# Add the Tickets Sold column to the movies table
movies = movies.with_column('Tickets Sold', tickets_sold)

# Print the updated movies table
movies
```

This code assumes that you have a CSV file named "movies.csv" containing the movies table. You can modify the code to match your specific file and table name.

The output will be a markdown table that includes the Tickets Sold column in addition to the existing columns (Year, Average Ticket Price, Total Gross, Number of Movies, and #1 Movie).

Note: Make sure you have the datascience module installed before executing the code. You can install it using the following command:

``` python
pip install datascience
```

Let me know if you need any further assistance or clarification!

That is interesting! Now, let's try out chatgpt's code!

In [27]:
# Calculate the Tickets Sold column
tickets_sold = movies.column('Total Gross') / movies.column('Average Ticket Price')

# Add the Tickets Sold column to the movies table
movies = movies.with_column('Tickets Sold', tickets_sold)

# Print the updated movies table
movies

Year | Average Ticket Price | Total Gross | Number of Movies | #1 Movie                                     | Tickets Sold
2019 | 9.16                 | 11237.9     | 788              | Avengers: Endgame                            | 1226.84
2018 | 9.11                 | 11611.3     | 878              | Black Panther                                | 1274.57
2017 | 8.97                 | 11125.4     | 740              | Star Wars: Episode VIII - The Last Jedi      | 1240.29
2016 | 8.65                 | 11373.7     | 737              | Rogue One: A Star Wars Story                 | 1314.88
2015 | 8.43                 | 11098.8     | 706              | Star Wars: Episode VII - The Force Awakens   | 1316.58
2014 | 8.17                 | 10436.8     | 708              | American Sniper                              | 1277.45
2013 | 8.13                 | 10955.9     | 689              | The Hunger Games: Catching Fire              | 1347.59
2012 | 7.96                 | 10959.6     | 669              | The Avengers                                 | 1376.83
2011 | 7.93                 | 10114.1     | 601              | Harry Potter and the Deathly Hallows: Part 2 | 1275.42
2010 | 7.89                 | 10212.7     | 538              | Toy Story 3                                  | 1294.39
... (33 rows omitted)